# Pandas basics

In [30]:
import numpy as np
import pandas as pd

## Series

In [32]:
ser = pd.Series(np.random.randn(10))
ser

0    0.423386
1   -0.202112
2    0.697944
3    1.018605
4   -0.805657
5   -1.709229
6   -0.166751
7    0.053516
8   -0.683041
9   -0.446597
dtype: float64

In [33]:
ser = pd.Series(np.random.randn(5), index='a b c d e'.split())
ser

a    1.174303
b    1.035019
c   -0.835369
d   -1.523295
e    0.545093
dtype: float64

In [36]:
ser = pd.Series({'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5})
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [38]:
ser['c']

3

In [43]:
ser = pd.Series(np.random.randn(100))
ser.mean()

0.12028544352151943

In [44]:
ser.median()

0.12471262626167998

In [48]:
ser.var()

0.7527787536105254

In [49]:
ser.describe()

count    100.000000
mean       0.120285
std        0.867628
min       -2.471970
25%       -0.399500
50%        0.124713
75%        0.783347
max        2.465886
dtype: float64

## Data frame

In [72]:
df = pd.DataFrame(np.random.randn(5,4))
df

          0         1         2         3
0 -2.608283  1.488906 -0.704879  1.048680
1  1.433952  0.510050  1.353018 -0.312053
2 -0.699344 -0.219292 -0.955811  1.436855
3  1.161468  0.825604  1.652385  0.728545
4  1.631819  0.295694 -0.323018  0.868905

In [73]:
df = pd.DataFrame(np.random.randn(5,4), 'a b c d e'.split(), 'w x y z'.split())
df

          w         x         y         z
a -0.210523 -2.001974  1.945387 -0.448872
b -1.081107  0.245848 -0.056450 -0.734369
c -1.035441  1.785701  1.060465  0.691069
d -0.969721 -0.822723 -0.441322  1.231352
e -0.466130 -1.320579 -1.120505  0.576710

In [74]:
# fetch by colummn
df['w']

a   -0.210523
b   -1.081107
c   -1.035441
d   -0.969721
e   -0.466130
Name: w, dtype: float64

In [75]:
df['w']['a']

-0.21052261433665737

In [103]:
# Fetch by row index
df.loc['a']

w   -0.210523
x   -2.001974
y    1.945387
z   -0.448872
Name: a, dtype: float64

In [104]:
# Fetch by row number
df.iloc[1]

w   -1.081107
x    0.245848
y   -0.056450
z   -0.734369
Name: b, dtype: float64

In [105]:
# Condition selection 
df[df > 0]

    w         x         y         z
a NaN       NaN  1.945387       NaN
b NaN  0.245848       NaN       NaN
c NaN  1.785701  1.060465  0.691069
d NaN       NaN       NaN  1.231352
e NaN       NaN       NaN  0.576710

In [107]:
# Conditions for columns
df[df['x'] > 0]

          w         x         y         z
b -1.081107  0.245848 -0.056450 -0.734369
c -1.035441  1.785701  1.060465  0.691069

In [109]:
df[(df['x']>0) & (df['y']>0)]

          w         x         y         z
c -1.035441  1.785701  1.060465  0.691069

In [110]:
# convert to numpy array
df.values

array([[-0.21052261, -2.00197363,  1.94538735, -0.44887235],
       [-1.08110652,  0.24584759, -0.05645045, -0.73436904],
       [-1.03544051,  1.78570126,  1.06046514,  0.69106865],
       [-0.96972062, -0.82272295, -0.44132198,  1.23135242],
       [-0.46613028, -1.32057901, -1.12050538,  0.57670952]])

In [152]:
# Hierarchical index
main_index = ['Google', 'Microsoft']
secondary_index = ['2020-01-15', '2020-01-14', '2020-01-13']
hier_index = pd.MultiIndex.from_product([main_index, secondary_index])

In [155]:
prices_df = pd.DataFrame([[1435, 1432], [1436, 1432], [1433, 1434], [162, 161], [162, 164], [162, 166]], 
                         hier_index,
                         [9, 10])
prices_df

                        9     10
Google    2020-01-15  1435  1432
          2020-01-14  1436  1432
          2020-01-13  1433  1434
Microsoft 2020-01-15   162   161
          2020-01-14   162   164
          2020-01-13   162   166

In [156]:
prices_df.loc['Google']

              9     10
2020-01-15  1435  1432
2020-01-14  1436  1432
2020-01-13  1433  1434

In [138]:
prices_df[9]

Google     2020-01-15    1435
           2020-01-14    1436
           2020-01-13     163
Microsoft  2020-01-15    1433
           2020-01-14    1434
           2020-01-13     162
Name: 9, dtype: int64

In [157]:
# with multi-index, column is still a series
type(prices_df[9])

pandas.core.series.Series

In [158]:
prices_df.index.names = ['Company', 'Date']
prices_df

                        9     10
Company   Date
Google    2020-01-15  1435  1432
          2020-01-14  1436  1432
          2020-01-13  1433  1434
Microsoft 2020-01-15   162   161
          2020-01-14   162   164
          2020-01-13   162   166

In [159]:
# filter on inner index
prices_df.xs('2020-01-15', level='Date')

             9     10
Company
Google     1435  1432
Microsoft   162   161

In [160]:
# aggregate 
prices_df.groupby('Company').mean()

                    9            10
Company
Google     1434.666667  1432.666667
Microsoft   162.000000   163.666667